
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES-CONNECTION-STRING
  * azurerm_key_vault_secret.POSTGRES_HOST
* Replace
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;darts&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-CONNECTION-STRING will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-CONNECTION-STRING" {
        id                      = "https://darts-prod.vault.azure.net/secrets/api-POSTGRES-CONNECTION-STRING/57066bbe062f4d098340ca6aacce251b"
        name                    = "api-POSTGRES-CONNECTION-STRING"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://darts-prod.vault.azure.net/secrets/api-POSTGRES-HOST/40316ef6c6b54deda6a18f00d54db771"
        name                    = "api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "darts-api-prod.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod" -> (known after apply)
        name                          = "darts-api-prod"
      ~ storage_tier                  = "P20" -> (known after apply)
        tags                          = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-api.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
      ~ version                       = "16" -> "15" # forces replacement
      - zone                          = "2" -> null
        # (14 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["darts"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod/databases/darts" -> (known after apply)
        name      = "darts"
      ~ server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2204,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->